public enum ItemName
{
	None,
	地狱弯刀,
	古希腊陶罐,
	混沌三叉戟,
	厄洛斯之香,
	狮鹫夜壶,
	乌洛波洛斯之盘,
	金十字镐
}

public enum IngredientName
{
    None,
	 龙肝,
	 蟾蜍原液,
	 鲸鱼肉和鱼子酱,
	 摩洛克牛排,
	 祭品奶酪,
	 撒旦脑花,
	 恶魔玛门,
	 无花果,
	 藏红花,
	 香槟酒,
	 西芹,
	 蜂蜜,
	 石榴,
	 混沌香料,
	 南美鼠肉,
	 冥府菇,
	 鼠尾草,
	 亡灵泉水,
	 缩序杜若
}

public enum CharacterName
{
	None, 
	别西卜,
	阿斯摩太,
	摩洛克,
	利维坦,
	巴力,
	贝尔芬格,
	玛门,
	撒旦,
	大饼,
	三叶虫,
	因诺,
	摸摸,
	牙牙乐,
	小葵,
	蓝七
}

public enum AudioName
{
	None,
	探索bgm, 主界面bgm, 开场动画bgm,
	亡灵饮水地, 喀戎之河, 塔尔塔洛斯, 极乐之野, 冥府侧殿主殿, 水仙花园, 遗忘之地,
	主界面按键音, 按键音效, 出现利维坦, 点击漩涡声,
	时间值滑块音效, 火力值滑块音效, 王打分时音效,
	逃离失败结局, 评分未通过死亡结局, 通关后反转真结局,
}